Ryan Barker
CPSC/ECE 3520 
Spring 2015
motion.log

--Test log showing sample operations of all predicates.--

?- ['test1.pro'].
% test1.pro compiled 0.00 sec, 2 clauses
true.

?- ['test1b.pro'].
% test1b.pro compiled 0.00 sec, 2 clauses
true.

?- ['test1c.pro'].
% test1c.pro compiled 0.00 sec, 2 clauses
true.

?- ['test1d.pro'].
% test1d.pro compiled 0.00 sec, 2 clauses
true.

?- ['test2.pro'].
% test2.pro compiled 0.00 sec, 2 clauses
true.

?- ['test2b.pro'].
% test2b.pro compiled 0.00 sec, 2 clauses
true.

?- ['test2c.pro'].
% test2c.pro compiled 0.00 sec, 2 clauses
true.

?- ['test2d.pro'].
% test2d.pro compiled 0.00 sec, 2 clauses
true.

?- ['motion.pro'].
% motion.pro compiled 0.00 sec, 37 clauses
true.

?- i1(I1),printImage(I1).

0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 1 2 0 0 0 0 0 0 
0 0 4 3 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 

I1 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], [0, 0, 4, 
3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i2(I2),printImage(I2).

0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 1 2 0 
0 0 0 0 0 0 0 4 3 0 
0 0 0 0 0 0 0 0 0 0 

I2 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], [0, 0, 0, 
0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i1b(I1B),printImage(I1B).

2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 

I1B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i2b(I2B),printImage(I2B).

2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 5 4 2 
2 2 2 2 2 2 2 5 4 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 2 

I2B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i1c(I1C),printImage(I1C).

2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 

I1C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i2c(I2C),printImage(I2C).

2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 5 4 
2 2 2 2 2 2 2 5 4 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 

I2C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i1d(I1D),printImage(I1D).

2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 5 4 
2 2 2 2 2 2 2 5 4 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 

I1D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i2d(I2D),printImage(I2D).

2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 
2 2 5 4 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 
2 2 2 2 2 2 2 2 2 

I2D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- printList([1,2,3,4]).
1 2 3 4 
true.

?- i1(I1),printListofLists(I1).
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 1 2 0 0 0 0 0 0 
0 0 4 3 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
I1 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], [0, 0, 4, 
3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- diffImRow([1,2,3,4],[5,6,7,8],DiffRow).
DiffRow = [4, 4, 4, 4].

?- diffImRow([-1,-1,-1,-1],[50,60,70,80],DiffRow).
DiffRow = [51, 61, 71, 81].

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm).
I1 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], [0, 0, 4, 
3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], [0, 0, 0, 
0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),printImage(DiffIm).

0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 -1 -2 0 0 0 0 0 0 
0 0 -4 -3 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 1 2 0 
0 0 0 0 0 0 0 4 3 0 
0 0 0 0 0 0 0 0 0 0 

I1 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], [0, 0, 4, 
3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], [0, 0, 0, 
0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i1b(I1B),i2b(I2B),diffIm(I1B,I2B,DiffIm),printImage(DiffIm).

0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 -3 -2 0 0 0 0 0 0 
0 0 -3 -2 0 0 0 3 2 0 
0 0 0 0 0 0 0 3 2 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 0 

I1B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -3, -2, 0, 0|...], [0, 
0, -3, -2, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- rowhasMotion([0,0,0,0,0,0]).
false.

?- rowhasMotion([0,0,1,0,0,0]).
true.

?- rowhasMotion([0,0,0,1,0,0]).
true.

?- i1c(I1C),i2c(I2C),diffIm(I1C,I2C,DiffIm),containsMotion(DiffIm).
I1C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -3, -2, 0, 0|...], [0, 
0, -3, -2, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i1c(I1C),i1c(I2C),diffIm(I1C,I2C,DiffIm),containsMotion(DiffIm).
false.

?- i1d(I1D),i2d(I2D),isDiff(I1D,I2D).
I1D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i1d(I1D),i1d(I2D),isDiff(I1D,I2D).
false.

?- rowmask([1,2,3,4,5],[-1,-1,-2,-3,-5],[1,-1,1,-1,1],I1M,I2M).
I1M = [0, 2, 0, 4, 0],
I2M = [-1, 0, -2, 0, -5].

?- rowmask([-1,3,-10,40],[-1,1,20,-32],[1,-1,1,-1],I1M,I2M).
I1M = [0, 3, 0, 40],
I2M = [-1, 0, 20, 0].

?- i1c(I1C),i1c(I2C),diffIm(I1C,I2C,DiffIm),mask(I1C,I2C,DiffIm,I1M,I2M),printImage(I1M).

0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 

I1C = I2C, I2C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 
2|...], [2, 2, 5, 4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
DiffIm = I1M, I1M = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 
0, 0, 0, 0|...], [0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], 
[...|...]|...].

?- i1d(I1D),i1d(I2D),diffIm(I1D,I2D,DiffIm),mask(I1D,I2D,DiffIm,I1M,I2M),printImage(I2M).

0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 

I1D = I2D, I2D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 
2|...], [2, 2, 2, 2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
DiffIm = I1M, I1M = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 
0, 0, 0, 0|...], [0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], 
[...|...]|...].

?- i1d(I1D),i2d(I2D),diffIm(I1D,I2D,DiffIm),mask(I1D,I2D,DiffIm,I1M,I2M),printImage(I2M).

0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 5 4 0 0 0 0 0 
0 0 5 4 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 
0 0 0 0 0 0 0 0 0 

I1D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 3, 2, 0, 0|...], [0, 0, 
3, 2, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], [0, 0, 0, 
0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 5, 4, 0, 0|...], [0, 0, 5, 
4, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- sumImRow([1,2,3,4], S).
S = 10.

?- sumImRow([0,0,0,0], S).
S = 0.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),sumImage(I1M, S).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
S = 10.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),sumImage(I2M, S).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
S = 10.

?- centImRowbyRow([0,0,0,0],1,CIR).
CIR = 0.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),centImRow(I1M, 1, CIR).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
CIR = 35.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),centImRow(I2M, 1, CIR).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
CIR = 85.

?- centImColbyRow([1,2,3,4],1,CIC).
CIC = 10.

?- centImColbyRow([0,0,0,0],1,CIC).
CIC = 0.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),centImCol(I1M, 1, CIC).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
CIC = 37.

?- i1(I1),i2(I2),diffIm(I1,I2,DiffIm),mask(I1,I2,DiffIm,I1M,I2M),centImCol(I2M, 1, CIC).
I1 = I1M, I1M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = I2M, I2M = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], 
[0, 0, 0, 0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
DiffIm = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, -1, -2, 0, 0|...], [0, 
0, -4, -3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
CIC = 87.

?- i1(I1),i2(I2),motion(I1,I2, Moti, Motj).
I1 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], [0, 0, 4, 
3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
I2 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0|...], [0, 0, 0, 
0, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...],
Moti = 4.999999999999999,
Motj = 5.0.

?- i1b(I1B),i2b(I2B),motion(I1B,I2B, Moti, Motj).
I1B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2B = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
Moti = 1.0,
Motj = 5.0.

?- i1c(I1C),i2c(I2C),motion(I1C,I2C, Moti, Motj).
I1C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2C = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
Moti = 1.0,
Motj = 5.0.

?- i1d(I1D),i2d(I2D),motion(I1D,I2D, Moti, Motj).
I1D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], [2, 2, 2, 
2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
I2D = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], [2, 2, 5, 
4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...],
Moti = -1.0,
Motj = -5.0.

?- i1(I1),i1(I2),motion(I1,I2, Moti, Motj).

***** No Motion in This Case *****
I1 = I2, I2 = [[0, 0, 0, 0, 0, 0, 0, 0|...], [0, 0, 0, 0, 0, 0, 0|...], [0, 0, 1, 2, 0, 0|...], 
[0, 0, 4, 3, 0|...], [0, 0, 0, 0|...], [0, 0, 0|...], [0, 0|...], [0|...], [...|...]|...].

?- i1b(I1),i1b(I2),motion(I1,I2, Moti, Motj).

***** No Motion in This Case *****
I1 = I2, I2 = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], 
[2, 2, 5, 4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i2c(I1),i2c(I2),motion(I1,I2, Moti, Motj).

***** No Motion in This Case *****
I1 = I2, I2 = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2|...], 
[2, 2, 2, 2, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- i2d(I1),i2d(I2),motion(I1,I2, Moti, Motj).

***** No Motion in This Case *****
I1 = I2, I2 = [[2, 2, 2, 2, 2, 2, 2, 2|...], [2, 2, 2, 2, 2, 2, 2|...], [2, 2, 5, 4, 2, 2|...], 
[2, 2, 5, 4, 2|...], [2, 2, 2, 2|...], [2, 2, 2|...], [2, 2|...], [2|...], [...|...]|...].

?- halt.
